artifacts/packs/openfoam-ecm-standalone_lumped_external_compat_cellprops_debug_20260330_134030/cases/lumped_solid/constant/g
FoamFile
{
    version     2.0;
    format      ascii;
    class       uniformDimensionedVectorField;
    location    "constant";
    object      g;
}

dimensions      [0 1 -2 0 0 0 0];
value           (0 0 0);
