artifacts/packs/openfoam-ecm-standalone_lumped_external_compat_cellprops_debug_20260330_134030/cases/lumped_solid/Allmesh
#!/bin/sh
cd "${0%/*}" || exit
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions
#------------------------------------------------------------------------------

runApplication blockMesh
runApplication surfaceFeatureExtract
runApplication snappyHexMesh -overwrite
runApplication splitMeshRegions -cellZones -overwrite

#------------------------------------------------------------------------------
